import string

text = "6^л:|&[л𝚑6%&𝚑éλ^Ωл!╩[л[$▙^#л⃥&#?жл⃥^л6^л༽^л[&𝚑[л!╩[лΨ⃝^[[éл^λл⃥^л:╩𝚑[лλ#è[лΨ𝚑^6жл⃝^л/ஏ#╩!^╩&л!⃝╩[$éл[|&[л[$^λλ^л!|&λ#^л༽я╩л!^#༽𝚑[л/ஏя╩༽|#λ𝚑#л༽╩л[$▙&λ^вл[$я^[λл/ஏя╩𝚑⃝⃝^&#[лéλ#╩6Ξ^лàл%&^⃝л!|𝚑6λл&6л[𝚑༽!⃝^л/ஏ#╩!^╩&л!^&λлΣ╩𝚑#^л!╩[[^#л&6^л[𝚑λ&╩λ𝚑|6л/ஏ^лλ#è[л/ஏ╩6Ξ^#^&[^лàл!╩#Σ╩𝚑λ^༽^6λлΨé6𝚑6^влΞ#╩[$^лàл[$^л/ஏ#╩!^╩&жлλ|&λл༽|6л[$|#![л:╩лΨ𝚑^6жл╩⃝|#[л%&я╩:╩6λл༽|6л[$|#![л6я╩⃝⃝╩𝚑λл!╩[лΨ𝚑^6вл⃥^л:|&[л#^[$|༽༽╩6/ஏ^л/ஏ|6[$л:𝚑:^༽^6λл/ஏ^л:|&[л!#|[$&#^#л/ஏ^[л!╩66^╩&Eл/ஏ╩6[л⃝^л[$╩[л|&л:|&[лΣ^#𝚑^Ωл/ஏ^л⃝╩лΞ?༽6╩[λ𝚑%&^л^λл%&^л:|&[лλ|༽Ψ^#𝚑^Ωл[&#л⃝╩лλ^λ^л!л!╩#л[$|6λ#^жл[$я^[λл:#╩𝚑༽^6λл&6лéλ#╩6Ξ^л/ஏ#╩!^╩&л:л404[$λΣ{[$|6λ#^ц⃝^[ц[$▙&λ^[ц[$▙^#[$▙^Ωц⃝^[ц/ஏ#╩!^╩&E}вл༽╩𝚑[л/ஏ&[$|&!жл!|&##╩𝚑[-⃥^л#^[$|༽༽^6[$^#л༽|6лé!#^&:^л[я𝚑⃝л:|&[л!⃝╩îλл?"

#text = text.replace("л", " ")
#text = text.replace("$", "C")
#text = text.replace("λ", "T")
#text = text.replace("Σ", "F")
#text = text.replace("^", "E")

#text = text.replace("[", "")
#text = text.replace("|", "")

print(text)

all_letters = {}
i = 1
for e in text:
    if e not in all_letters:
        all_letters[e] = i
        i += 1

map_inv = {k:v for k, v in all_letters.items()}

print()
print(all_letters)
print(len(all_letters))

charset = string.ascii_uppercase + string.digits
print(charset)
print(len(charset))